# Inflows and Outflows
- This notebook studies how sections differ based on their 'inflows' and 'outflows'
- An inflow is when a ride enters a location that it did not start in 
- An outflow is when a ride leaves its starting location
- A 'local' ride begins and ends in the same location

## Findings
- Locations can differ significantly in their net inflows and outflows
- The majority of zones with the highest outflow rates are parks
- Airports feature a higher outflow rate than inflow rate

In [1]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://root:root@localhost:5432/uber')
engine.connect()

%load_ext sql
%sql postgresql://root:root@localhost:5432/uber

In [3]:
%%sql
SELECT * FROM main LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
10 rows affected.

[(10840404, 'HV0005', 'B02510', None, datetime.datetime(2019, 8, 17, 15, 59, 10), None, datetime.datetime(2019, 8, 17, 16, 2, 35), datetime.datetime(2019, 8, 17, 16, 32, 28), 143, 145, 4.239, 1793, 19.41, 0.16, 0.49, 1.74, 2.75, None, 0.0, 19.44, 'N', 'N', 'N', 'N', 'N', 16, 'Saturday', 'Lyft', 0, 4.585987, 0.65052986),
 (2252549, 'HV0003', 'B02870', 'B02870', datetime.datetime(2019, 8, 4, 3, 15, 51), datetime.datetime(2019, 8, 4, 3, 24, 27), datetime.datetime(2019, 8, 4, 3, 24, 27), datetime.datetime(2019, 8, 4, 3, 31, 54), 80, 198, 1.54, 447, 0.0, 0.0, 0.0, 0.0, 0.0, None, 0.0, 0.0, 'N', 'N', ' ', 'N', 'N', 3, 'Sunday', 'Uber', 0, 0.0, 0.0),
 (13745783, 'HV0003', 'B02879', 'B02879', datetime.datetime(2019, 8, 22, 7, 42, 4), datetime.datetime(2019, 8, 22, 7, 43, 54), datetime.datetime(2019, 8, 22, 7, 45, 32), datetime.datetime(2019, 8, 22, 7, 50, 41), 69, 119, 1.32, 308, 3.85, 0.0, 0.0, 0.33, 0.0, None, 0.0, 5.39, 'N', 'N', ' ', 'N', 'N', 7, 'Thursday', 'Uber', 0, 4.0833335, 1.05),
 (2620430, 'HV0005', 'B02510', None, datetime.datetime(2019, 8, 4, 17, 25, 30), None, datetime.datetime(2019, 8, 4, 17, 29, 54), datetime.datetime(2019, 8, 4, 17, 43, 10), 144, 162, 2.85, 796, 19.74, 0.0, 0.49, 1.75, 2.75, None, 3.71, 9.7, 'N', 'N', 'N', 'N', 'N', 17, 'Sunday', 'Lyft', 1, 3.4035087, 0.73115575),
 (3601407, 'HV0003', 'B02875', 'B02875', datetime.datetime(2019, 8, 6, 12, 8, 15), datetime.datetime(2019, 8, 6, 12, 8, 25), datetime.datetime(2019, 8, 6, 12, 10, 25), datetime.datetime(2019, 8, 6, 12, 21, 24), 244, 119, 3.1, 636, 9.34, 0.0, 0.0, 0.81, 0.0, None, 0.0, 8.83, 'N', 'N', ' ', 'N', 'N', 12, 'Tuesday', 'Uber', 0, 2.848387, 0.83301884),
 (2863573, 'HV0003', 'B02869', 'B02869', datetime.datetime(2019, 8, 5, 5, 0, 6), datetime.datetime(2019, 8, 5, 5, 0, 12), datetime.datetime(2019, 8, 5, 5, 2, 47), datetime.datetime(2019, 8, 5, 5, 13, 18), 167, 213, 3.5, 632, 17.76, 0.0, 0.0, 1.54, 0.0, None, 0.0, 13.57, 'N', 'N', ' ', 'N', 'N', 5, 'Monday', 'Uber', 0, 3.877143, 1.2882911),
 (7773871, 'HV0003', 'B02883', 'B02883', datetime.datetime(2019, 8, 12, 19, 49, 50), datetime.datetime(2019, 8, 12, 19, 50, 1), datetime.datetime(2019, 8, 12, 19, 52, 26), datetime.datetime(2019, 8, 12, 20, 3, 52), 125, 148, 1.64, 675, 11.5, 0.0, 0.0, 1.0, 2.75, None, 0.0, 7.45, 'N', 'N', ' ', 'N', 'N', 19, 'Monday', 'Uber', 0, 4.542683, 0.6622222),
 (13497465, 'HV0005', 'B02510', None, datetime.datetime(2019, 8, 21, 18, 57, 26), None, datetime.datetime(2019, 8, 21, 19, 2, 31), datetime.datetime(2019, 8, 21, 19, 36, 55), 186, 229, 2.796, 2064, 11.35, 0.0, 0.28, 1.01, 0.75, None, 0.0, 0.0, 'Y', 'Y', 'N', 'N', 'N', 19, 'Wednesday', 'Lyft', 0, 0.0, 0.0),
 (12036795, 'HV0003', 'B02877', 'B02877', datetime.datetime(2019, 8, 19, 9, 28, 33), datetime.datetime(2019, 8, 19, 9, 30, 20), datetime.datetime(2019, 8, 19, 9, 31, 26), datetime.datetime(2019, 8, 19, 9, 34, 50), 119, 247, 0.84, 203, 0.0, 0.0, 0.0, 0.0, 0.0, None, 0.0, 0.0, 'N', 'N', ' ', 'N', 'N', 9, 'Monday', 'Uber', 0, 0.0, 0.0),
 (13943106, 'HV0005', 'B02510', None, datetime.datetime(2019, 8, 22, 14, 0, 58), None, datetime.datetime(2019, 8, 22, 14, 5, 32), datetime.datetime(2019, 8, 22, 15, 6, 48), 36, 48, 9.696, 3676, 31.48, 0.0, 0.86, 3.06, 0.75, None, 0.0, 0.0, 'Y', 'Y', 'N', 'N', 'N', 14, 'Thursday', 'Lyft', 0, 0.0, 0.0)]

In [4]:
%%sql
DROP TABLE IF EXISTS inflows ;

CREATE TEMPORARY TABLE inflows AS 
SELECT "PULocationID" "location",
COALESCE(COUNT(*), 0)::numeric count
FROM main
WHERE "PULocationID" != "DOLocationID"
GROUP BY "PULocationID"
ORDER BY "PULocationID";

SELECT * FROM inflows LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
Done.
261 rows affected.
10 rows affected.

[(1, Decimal('10')),
 (2, Decimal('1')),
 (3, Decimal('329')),
 (4, Decimal('838')),
 (5, Decimal('32')),
 (6, Decimal('73')),
 (7, Decimal('1713')),
 (8, Decimal('12')),
 (9, Decimal('166')),
 (10, Decimal('557'))]

In [5]:
%%sql
DROP TABLE IF EXISTS outflows;

CREATE TEMPORARY TABLE outflows AS 
SELECT "DOLocationID" "location",
COALESCE(COUNT(*), 0)::numeric count
FROM main
WHERE "PULocationID" != "DOLocationID"
GROUP BY "DOLocationID"
ORDER BY "DOLocationID";

SELECT * FROM outflows LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
Done.
260 rows affected.
10 rows affected.

[(1, Decimal('1141')),
 (2, Decimal('1')),
 (3, Decimal('358')),
 (4, Decimal('682')),
 (5, Decimal('37')),
 (6, Decimal('91')),
 (7, Decimal('1736')),
 (8, Decimal('15')),
 (9, Decimal('154')),
 (10, Decimal('452'))]

In [6]:
%%sql
DROP TABLE IF EXISTS locals;

CREATE TEMPORARY TABLE locals AS 
SELECT "DOLocationID" "location",
COALESCE(COUNT(*), 0)::numeric count
FROM main
WHERE "PULocationID" = "DOLocationID"
GROUP BY "DOLocationID"
ORDER BY "DOLocationID";

SELECT * FROM locals LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
Done.
241 rows affected.
10 rows affected.

[(3, Decimal('30')),
 (4, Decimal('4')),
 (5, Decimal('4')),
 (6, Decimal('4')),
 (7, Decimal('245')),
 (9, Decimal('11')),
 (10, Decimal('37')),
 (11, Decimal('11')),
 (13, Decimal('11')),
 (14, Decimal('227'))]

In [7]:
%%sql
SELECT * FROM zones LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
10 rows affected.

[(0, 1, 'EWR', 'Newark Airport', 'EWR'),
 (1, 2, 'Queens', 'Jamaica Bay', 'Boro Zone'),
 (2, 3, 'Bronx', 'Allerton/Pelham Gardens', 'Boro Zone'),
 (3, 4, 'Manhattan', 'Alphabet City', 'Yellow Zone'),
 (4, 5, 'Staten Island', 'Arden Heights', 'Boro Zone'),
 (5, 6, 'Staten Island', 'Arrochar/Fort Wadsworth', 'Boro Zone'),
 (6, 7, 'Queens', 'Astoria', 'Boro Zone'),
 (7, 8, 'Queens', 'Astoria Park', 'Boro Zone'),
 (8, 9, 'Queens', 'Auburndale', 'Boro Zone'),
 (9, 10, 'Queens', 'Baisley Park', 'Boro Zone')]

In [8]:
%%sql
DROP TABLE IF EXISTS flows;

CREATE TEMPORARY TABLE flows AS 
SELECT 
zones."Zone", 
zones."Borough", 
COALESCE(inflows.count, 0) inflows,
COALESCE(outflows.count, 0) outflows,
COALESCE(locals.count, 0) locals
FROM zones 
    LEFT JOIN inflows 
    ON zones."LocationID" = inflows.location
    LEFT JOIN outflows 
    ON zones."LocationID" = outflows.location
    LEFT JOIN locals 
    ON zones."LocationID" = locals.location
;

SELECT * FROM flows LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
Done.
263 rows affected.
10 rows affected.

[('Allerton/Pelham Gardens', 'Bronx', Decimal('329'), Decimal('358'), Decimal('30')),
 ('Alphabet City', 'Manhattan', Decimal('838'), Decimal('682'), Decimal('4')),
 ('Arden Heights', 'Staten Island', Decimal('32'), Decimal('37'), Decimal('4')),
 ('Arrochar/Fort Wadsworth', 'Staten Island', Decimal('73'), Decimal('91'), Decimal('4')),
 ('Astoria', 'Queens', Decimal('1713'), Decimal('1736'), Decimal('245')),
 ('Auburndale', 'Queens', Decimal('166'), Decimal('154'), Decimal('11')),
 ('Baisley Park', 'Queens', Decimal('557'), Decimal('452'), Decimal('37')),
 ('Bath Beach', 'Brooklyn', Decimal('172'), Decimal('187'), Decimal('11')),
 ('Battery Park City', 'Manhattan', Decimal('1110'), Decimal('1232'), Decimal('11')),
 ('Bay Ridge', 'Brooklyn', Decimal('704'), Decimal('840'), Decimal('227'))]

In [9]:
%%sql
ALTER TABLE flows 
ADD total int;

UPDATE flows
SET total = inflows + outflows + locals;

SELECT * FROM flows LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
Done.
263 rows affected.
10 rows affected.

[('Allerton/Pelham Gardens', 'Bronx', Decimal('329'), Decimal('358'), Decimal('30'), 717),
 ('Alphabet City', 'Manhattan', Decimal('838'), Decimal('682'), Decimal('4'), 1524),
 ('Arden Heights', 'Staten Island', Decimal('32'), Decimal('37'), Decimal('4'), 73),
 ('Arrochar/Fort Wadsworth', 'Staten Island', Decimal('73'), Decimal('91'), Decimal('4'), 168),
 ('Astoria', 'Queens', Decimal('1713'), Decimal('1736'), Decimal('245'), 3694),
 ('Auburndale', 'Queens', Decimal('166'), Decimal('154'), Decimal('11'), 331),
 ('Baisley Park', 'Queens', Decimal('557'), Decimal('452'), Decimal('37'), 1046),
 ('Bath Beach', 'Brooklyn', Decimal('172'), Decimal('187'), Decimal('11'), 370),
 ('Battery Park City', 'Manhattan', Decimal('1110'), Decimal('1232'), Decimal('11'), 2353),
 ('Bay Ridge', 'Brooklyn', Decimal('704'), Decimal('840'), Decimal('227'), 1771)]

In [17]:
%%sql
SELECT percentile_cont(0.05) WITHIN GROUP (ORDER BY total ASC)
FROM flows

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(50.70000000000001,)]

### Highest Percent of Inflows

In [19]:
%%sql
SELECT 
flows."Zone",
flows."Borough",
ROUND(
    100*inflows / (total)
,2) inflow_percent, 
inflows, outflows
FROM flows
WHERE (inflows + outflows > 0)
AND total > (SELECT percentile_cont(0.05) WITHIN GROUP (ORDER BY total ASC) FROM flows)
ORDER BY (inflows / (total)) DESC
LIMIT 20;

 * postgresql://root:***@localhost:5432/uber
20 rows affected.

[('Crotona Park', 'Bronx', Decimal('59.09'), Decimal('39'), Decimal('26')),
 ('Sutton Place/Turtle Bay North', 'Manhattan', Decimal('57.61'), Decimal('1396'), Decimal('1016')),
 ('Hollis', 'Queens', Decimal('57.30'), Decimal('212'), Decimal('152')),
 ('Cambria Heights', 'Queens', Decimal('57.10'), Decimal('181'), Decimal('124')),
 ('Stuy Town/Peter Cooper Village', 'Manhattan', Decimal('56.94'), Decimal('632'), Decimal('477')),
 ('Springfield Gardens North', 'Queens', Decimal('56.54'), Decimal('359'), Decimal('256')),
 ('Marble Hill', 'Manhattan', Decimal('56.50'), Decimal('187'), Decimal('141')),
 ('City Island', 'Bronx', Decimal('55.67'), Decimal('54'), Decimal('43')),
 ('Little Italy/NoLiTa', 'Manhattan', Decimal('55.38'), Decimal('1653'), Decimal('1308')),
 ('Greenwich Village North', 'Manhattan', Decimal('55.29'), Decimal('1401'), Decimal('1123')),
 ('Westerleigh', 'Staten Island', Decimal('55.26'), Decimal('105'), Decimal('74')),
 ('Lincoln Square West', 'Manhattan', Decimal('55.17'), Decimal('1036'), Decimal('824')),
 ('Cobble Hill', 'Brooklyn', Decimal('55.11'), Decimal('275'), Decimal('224')),
 ('Alphabet City', 'Manhattan', Decimal('54.99'), Decimal('838'), Decimal('682')),
 ('West Village', 'Manhattan', Decimal('54.92'), Decimal('1751'), Decimal('1413')),
 ('Yorkville East', 'Manhattan', Decimal('54.90'), Decimal('907'), Decimal('740')),
 ('Flatiron', 'Manhattan', Decimal('54.89'), Decimal('1363'), Decimal('1104')),
 ('Gowanus', 'Brooklyn', Decimal('54.73'), Decimal('457'), Decimal('375')),
 ('Clinton West', 'Manhattan', Decimal('54.68'), Decimal('1442'), Decimal('1170')),
 ('Red Hook', 'Brooklyn', Decimal('54.57'), Decimal('448'), Decimal('363'))]

### Highest Percent of Outflows

In [20]:
%%sql
SELECT 
flows."Zone",
flows."Borough",
ROUND(
    100*outflows / (total)
,2) outflow_percent, 
inflows, outflows
FROM flows
WHERE (total > 0)
AND total > (SELECT percentile_cont(0.05) WITHIN GROUP (ORDER BY total ASC) FROM flows)
ORDER BY (outflows / (total)) DESC
LIMIT 20;

 * postgresql://root:***@localhost:5432/uber
20 rows affected.

[('Newark Airport', 'EWR', Decimal('99.13'), Decimal('10'), Decimal('1141')),
 ('Randalls Island', 'Manhattan', Decimal('70.92'), Decimal('41'), Decimal('100')),
 ('Pelham Bay Park', 'Bronx', Decimal('60.90'), Decimal('52'), Decimal('81')),
 ('Breezy Point/Fort Tilden/Riis Beach', 'Queens', Decimal('59.14'), Decimal('36'), Decimal('55')),
 ('Battery Park', 'Manhattan', Decimal('58.59'), Decimal('41'), Decimal('58')),
 ('Flushing Meadows-Corona Park', 'Queens', Decimal('57.22'), Decimal('238'), Decimal('321')),
 ('Penn Station/Madison Sq West', 'Manhattan', Decimal('56.54'), Decimal('1695'), Decimal('2225')),
 ('Prospect Park', 'Brooklyn', Decimal('55.95'), Decimal('178'), Decimal('235')),
 ('Inwood Hill Park', 'Manhattan', Decimal('54.78'), Decimal('52'), Decimal('63')),
 ('Marine Park/Floyd Bennett Field', 'Brooklyn', Decimal('54.67'), Decimal('34'), Decimal('41')),
 ('LaGuardia Airport', 'Queens', Decimal('54.24'), Decimal('3458'), Decimal('4118')),
 ('Arrochar/Fort Wadsworth', 'Staten Island', Decimal('54.17'), Decimal('73'), Decimal('91')),
 ('Van Cortlandt Park', 'Bronx', Decimal('54.15'), Decimal('103'), Decimal('124')),
 ('Brooklyn Navy Yard', 'Brooklyn', Decimal('54.05'), Decimal('170'), Decimal('200')),
 ('JFK Airport', 'Queens', Decimal('53.69'), Decimal('3283'), Decimal('3931')),
 ('Elmhurst/Maspeth', 'Queens', Decimal('53.27'), Decimal('346'), Decimal('416')),
 ('Bronx Park', 'Bronx', Decimal('52.94'), Decimal('80'), Decimal('90')),
 ('Columbia Street', 'Brooklyn', Decimal('52.56'), Decimal('109'), Decimal('123')),
 ('Windsor Terrace', 'Brooklyn', Decimal('52.42'), Decimal('283'), Decimal('325')),
 ('Battery Park City', 'Manhattan', Decimal('52.36'), Decimal('1110'), Decimal('1232'))]

### Airports

In [12]:
%%sql
SELECT 
flows."Zone",
ROUND(
    100*inflows / (total)
,2) inflow_percent, 
ROUND(
    100*outflows / (total)
,2) outflow_percent, 
ROUND(
    100*locals / (total)
,2) local_percent, 
total
FROM flows
WHERE "Zone" LIKE '%Airport%'
ORDER BY (inflows / (total)) ASC
LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
3 rows affected.

[('Newark Airport', Decimal('0.87'), Decimal('99.13'), Decimal('0.00'), 1151),
 ('JFK Airport', Decimal('44.84'), Decimal('53.69'), Decimal('1.46'), 7321),
 ('LaGuardia Airport', Decimal('45.55'), Decimal('54.24'), Decimal('0.21'), 7592)]